#  Начинаю делать первый проект
name_assistant='Oleg'
print(f'Я твой ассистент. Меня зовут {name_assistant}. Приятно познакомиться.')
name_user=input('Как мне к тебе обращаться? ')
print(f'Приятно познакомиться, {name_user}')
age_user=int(input('Сколько тебе лет? '))
print('Ого, ты уже взрослый человек. Представляешь, через 10 лет тебе будет', age_user + 10, 'лет!')
rise_user=float(input('Какой у тебя рост? '))
print('Да уж, ты очень высокий. Мой рост всего лишь 0.53. Ты выше меня на', rise_user - 0.53, 'метра!' )
print(f'Я столько всего о тебе узнал! тебя зовут {name_user}, тебе {age_user} лет, твой рост {rise_user} метра!')
print("""Чем я могу тебе помочь?
1) Посоветовать вкусный коктейль
2) Рассказать сказку
3) Написать стих""")
answer = int(input('Выберите действие: '))
if answer == 1:
    answer_two = int(input('Выберите коктейль: 1) Молочный, 2)Кофейный, 3)Компот: '))
    if answer_two == 1:
        print('Вкусный рецепт молочного коктейля: Клубника - 300 грамм, молоко - 500 мл, мороженое - 200 грамм')
    elif answer_two == 2:
        print('''Кофе молотый 1 ч.л.
Вода 60 мл
Молоко 3.6% 200 мл
Сахар-песок по вкусу
Корица по вкусу
Ваниль по вкусу
Шоколадная крошка по вкусу''')
    elif answer_two == 3:
        print("""небольшой лимон – 1 шт.
замороженная вишня без косточек – 400 г
питьевая вода – 2 л
сахар – 200–300 г""")
    else:
        print('К сожалению, я не понял вашу команду. Попробуйте еще раз... ')
elif answer == 2:
    print("""Волк и семеро козлят
Жила-была коза с козлятами. Уходила коза в лес есть траву шелковую, пить воду студеную. Как только уйдет — козлятки запрут избушку и сами никуда не выходят. Воротится коза, постучится в дверь и запоет:
— Козлятушки, ребятушки!
Отопритеся, отворитеся!
Ваша мать пришла — молока принесла;
Бежит молоко по вымечку,
Из вымечка по копытечку,
Из копытечка во сыру землю!
Козлятки отопрут дверь и впустят мать. Она их покормит, напоит и опять уйдет в лес, а козлята запрутся крепко-накрепко.
Волк подслушал, как поет коза. Вот раз коза ушла, волк побежал к избушке и закричал толстым голосом:
— Вы, детушки!
Вы, козлятушки!
Отопритеся,
Отворитеся,
Ваша мать пришла,
Молока принесла.
Полны копытцы водицы!
Козлята ему отвечают:
— Слышим, слышим — да не матушкин это голосок! Наша матушка поет тонюсеньким голосом и не так причитает.
Волку делать нечего. Пошел он в кузницу и велел себе горло перековать, чтоб петь тонюсеньким голосом. Кузнец ему горло перековал. Волк опять побежал к избушке и спрятался за куст.
Вот приходит коза и стучится:
— Козлятушки, ребятушки!
Отопритеся, отворитеся!
Ваша мать пришла — молока принесла;
Бежит молоко по вымечку,
Из вымечка по копытечку,
Из копытечка во сыру землю!
Козлята впустили мать и давай рассказывать, как приходил волк, хотел их съесть.
Коза накормила, напоила козлят и строго-настрого наказала:
— Кто придет к избушечке, станет проситься толстым голосом да не переберет всего, что я вам причитываю, — дверь не отворяйте, никого не впускайте.
Только ушла коза, волк опять шасть к избушке, постучался и начал причитывать тонюсеньким голосом:
— Козлятушки, ребятушки!
Отопритеся, отворитеся!
Ваша мать пришла — молока принесла;
Бежит молоко по вымечку,
Из вымечка по копытечку,
Из копытечка во сыру землю!
Козлята отворили дверь, волк кинулся в избу и всех козлят съел. Только один козленочек схоронился в печке.

Приходит коза; сколько ни звала, ни причитывала — никто ей не отвечает. Видит — дверь отворена, вбежала в избушку — там нет никого. Заглянула в печь и нашла одного козленочка.
Как узнала коза о своей беде, как села она на лавку — начала горевать, горько плакать:
— Ох вы, детушки мои, козлятушки!
На что отпиралися-отворялися,
Злому волку доставалися?
Услыхал это волк, входит в избушку и говорит козе:
— Что ты на меня грешишь, кума? Не я твоих козлят съел. Полно горевать, пойдем лучше в лес, погуляем.
Пошли они в лес, а в лесу была яма, а в яме костер горел. Коза и говорит волку:
— Давай, волк, попробуем, кто перепрыгнет через яму?
Стали они прыгать. Коза перепрыгнула, а волк прыгнул, да и ввалился в горячую яму.
Брюхо у него от огня лопнуло, козлята оттуда выскочили, все живые, да — прыг к матери! И стали они жить-поживать по-прежнему.""")
elif answer == 3: 
    print("""Мишка
Уронили мишку на пол,
Оторвали мишке лапу.
Все равно его не брошу –
Потому что он хороший.""")
else:
    print('К сожалению, я не понял вашу команду. Попробуйте еще раз...')


 