print("Здравствуйте, я ваш личный ассистент Олег.")
us_name = input("Представьтесь, пожалуйста: ")
print(f"Приятно познакомиться, {us_name}.")
print("""Вот что я могу вам предложить:
      1)калькулятор
      2)рецепт
      3)упражнения для поддержания хорошего самочувствия""")
us_answer = int(input("Выберите действие: "))
if us_answer == 1:
    print("Добро пожаловать в калькулятор.")
    num_one = int(input("Введите первое число: "))
    sign = input("Введите знак: ")
    num_two = int(input("Введите второе число: "))
    if sign == "+":
        result = num_one + num_two
        print(f"результат: {result}")
    elif sign == "-":
        result = num_one - num_two
        print(f"результат: {result}")
    elif sign == "*":
        result = num_one * num_two
        print(f"результат: {result}")
    elif sign == "/":
        result = num_one / num_two
        print(f"результат: {result}")
    elif sign == "**":
        result = num_one ** num_two
        print(f"результат: {result}")
    else:
        print("Некорректный ввод знака")
elif us_answer == 2:
    print("Отлично, вот ссылка на сайт с рецептами https://www.gastronom.ru/ ")
elif us_answer == 3:
    print("В здоровом теле - здоровый дух!")
    exerсise = int(input("""Какие конкретно упражниения вас интересуют?
    1)Для осанки
    2)На растяжку
    3)Кардио
    Ваш выбор: """))
    if exerсise == 1:
        print(""" Планка:
Лягте на пол на живот, поставьте руки ладонями вниз под плечевые суставы и поднимите тело, вытянув его в струну.
Руки и тело должны быть прямыми, таз слегка подтянут к животу, носки ступней упираются в пол.
Есть и другие варианты планки, например, с опорой на согнутые колени.
 Растяжка грудных мыщц:
Станьте в дверной проем.
Раскройте руки в сторону и зафиксируйте их на дверном проеме.
Плавно потянитесь грудью вперед.
 Сфинкс
Исходное положение: лежа на животе, ноги вместе, локти согнуты, предплечья и ладони упираются в пол.
На вдохе плавно приподнимите верхнюю часть тела, выпрямите руки и потянитесь головой вверх.
Дыхание должно быть свободным, голову не запрокидывайте.
Задержитесь в этой позе на 30-60 секунд.""")
    elif exerсise == 2:
        print(""" Бабочка:
Сядьте на пол, согнув ноги и соединив стопы. Наклоняйтесь вперед, обхватив щиколотки и надавливая на бедра локтями. 
Стремитесь коснуться пола лбом. Спина может быть выпрямленной или изогнутой. Ориентируйтесь на ощущения комфорта. 
Держитесь в позиции наклона 30 секунд. Расслабьтесь и повторите 3-4 раза.
 Складка:
Сядьте на пол, выпрямив спину и вытянув ноги вперед. На вдохе сильно потянитесь вверх, 
а на выдохе потянитесь вперед, растягивая верхнюю часть спины. 
При излишнем напряжении в спине или ногах слегка согните колени. 
Можете воспользоваться полотенцем для полного вытягивания, накинув его на стопы. 
Повторите 3-5 раз.
 Наклон к полу:
Из вертикального положения мягко склонитесь к полу, стараясь коснуться его руками не выгибая спину. 
Живот касается верхней части бедер. Делайте легкие и плавные движения вперед 5-7 секунд, 
растягивая мышцы задней части ног и ягодиц. 
Кто лучше подготовлен, обнимите свои ноги, стремясь коснуться их головой.""")
    elif exerсise == 3:
        print("""Ходьба: отличный вариант для начинающих. 20-30 минут в день, увеличивая продолжительность и темп.
Бег: начните с лёгкого бега трусцой, чередуя его с ходьбой, чтобы избежать перегрузки.
Велосипед: эффективный способ укрепления ног и улучшения выносливости как на улице, так и в зале.
Плавание: отличная кардионагрузка, развивает все группы мышц и улучшает работу легких.
Аэробные классы: Занятия аэробикой или танцами могут сделать тренировки более увлекательными.""")
    
